import styles from "./index.module.css";

const SectionPolicy = () => {
  return (
    <section id="policy" className={styles.policyMain}>
      <div className={styles.policySection}>
        <div className={`${styles.policyTitle} font-title-l title-l-m `}>
          ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            1. Загальні положення
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Політика конфіденційності – правила, якими регламентується збір,
            обробка, використання і захист персональних даних, що можуть бути
            запитані/отримані при використанні вебсайту feniks.army (далі –
            Сайт).
            <br /> <br />
            Персональні дані – відомості чи сукупність відомостей про фізичну
            або юридичну особу, яка ідентифікована або може бути конкретно
            ідентифікована. <br /> <br />
            Адміністратор Сайту з великою повагою ставиться до конфіденційної
            (персональної) інформації будь-яких осіб, які використовують
            інформацію, розміщену на Сайті, а також суб’єктів Сайту –
            зареєстрованих на Сайті користувачів, уповноважених осіб
            провайдерів, викладачів (тренерів), тому прагнемо захищати
            конфіденційність персональних даних, тим самим створюючи й
            забезпечуючи максимально комфортні умови для використання Сайту.
            <br /> <br />
            Заповнюючи дані реєстраційної форми та проставляючи відмітку про
            ознайомлення з даною Політикою конфіденційності (далі – Політика),
            Ви надаєте згоду на обробку Ваших персональних даних з метою
            забезпечення рольового доступу, підготовки статистичної,
            адміністративної та іншої інформації з питань професійного навчання.
            <br /> <br />
            Перед використанням Сайту уважно ознайомтесь з Вашими правами та
            обов’язками щодо обробки персональних даних, які зазначені в статті
            8 Закону України «Про захист персональних даних», даною Політикою, а
            також висловіть свою повну згоду з її умовами.
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            2. Збір та використання персональних даних
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Збір персональних даних здійснюється виключно за Вашим свідомим та
            добровільним рішенням як суб’єкта персональних даних для
            використання функціональних можливостей Сайту та відповідно до
            сформульованої в цій Політиці мети обробки персональних даних.{" "}
            <br /> <br />
            Масштаби і тип збору та використання Ваших персональних даних
            різняться залежно від того, в якій ролі Ви плануєте використовувати
            функціональні можливості Сайту. <br /> <br />
            Здійснюючи залежно від обраної Вами ролі реєстрацію на Сайті та
            заповнюючи дані особистого облікового запису Ви надаєте наступні
            дані: <br />{" "}
            <ul>
              <li>
                ПІБ, дата народження, стать, або інші ідентифікаційні дані,
                номер телефону та e-mail;
              </li>
              <li>
                відомості, що стосуються Вашої професійної діяльності: місце
                роботи, посада, категорія посади, спеціальність, кваліфікація,
                науковий ступінь, вчене звання тощо;
              </li>
              <li>додаткові реєстраційні.</li>
            </ul>
            <br /> <br />
            При подальшому використанні Сайту автоматично здійснюється збір
            інформації про що містяться в запитах форм зворотного зв’язку /
            електронних повідомленнях.
            <br /> <br />
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            3. Мета збору, обробки та використання персональних даних
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Збір, обробка та використання персональних даних здійснюється з
            метою забезпечення рольового доступу, зокрема: <br />{" "}
            <ul className={styles.ul}>
              <li>реєстрації суб’єктів Сайту;</li>
              <li>
                організації електронної взаємодії суб’єктів Сайту через особисті
                кабінети;
              </li>
              <li>
                узагальнення та систематизації реєстрів та структурованих даних,
                зокрема:
                <ul className={styles.ul}>
                  <li>формування переліку;</li>
                  <li>
                    моніторинг, узагальнення та аналіз статистичних даних, що
                    формуються суб’єктами Сайту в результаті його використання.
                  </li>
                </ul>
              </li>
            </ul>
            <br />
            Персональні дані зберігаються на строк не більше, ніж це необхідно
            відповідно до мети їх збору, обробки та використання або до моменту
            припинення Вами використання Сайту шляхом видалення свого облікового
            запису на Сайті.
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            4. Доступ до персональних даних
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Повний доступ до персональних даних зареєстрованих суб’єктів Порталу
            надано уповноваженій особі адміністратора Сайту.
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            5. Передача персональних даних третім особам
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Адміністратор Сайт не передає та не розголошує персональні дані, які
            отримує від зареєстрованих суб’єктів Сайту, третім особам.
            <br />
            <br />
            Розкриття персональних даних можливе у випадках, визначених чинним
            законодавством України, а також у випадку залучення третіх сторін,
            що надають технічну підтримку та/або послуги щодо удосконалення
            Сайту на умовах договору та за умови нерозголошення персональних
            даних.
            <br />
            <br />
            Портал може містити гіперпосилання на сторонні веб-сайти та інші
            ресурси в мережі Інтернет третіх осіб. Ресурси третіх осіб можуть
            регулюватися власними правилами користування та конфіденційності.
            Ресурси третіх осіб та їх контент не перевіряються нами на
            відповідність вимогам (достовірності, повноти, законності тощо).
            Головний відділ безпілотних авіаційних систем Державної Прикордонної
            Служби України “Фенікс” не несе відповідальності за будь-яку
            інформацію, матеріали, розміщені на ресурсах третіх осіб.
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            6. Захист персональних даних
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Адміністратор Сайту вживає необхідних процедурних і технічних
            заходів щодо захисту Ваших персональних даних від їх втрати,
            неправомірного доступу до них або їх розповсюдження на Сайті.
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            7. Зміни до умов Політики
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Адміністратор Сайту може змінювати цю Політику, щоб вона точно
            відображала методи збору, обробки, використання, доступу та захисту
            персональних даних. <br />
            <br /> Відповідно Ви повинні переглядати цю Політику періодично.
            Коли адміністратор Сайту змінює цю Політику, він оновлює дату
            «останньої зміни» у верхній частині цієї Політики. Зміни до цієї
            Політики є ефективними, коли вони опубліковані.
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            8. Ваші права
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Зареєструвавшись на Сайті, Ви маєте право: <br />{" "}
            <ul>
              <li>
                отримувати інформацію про джерела збору та місце збереження
                своїх персональних даних, мету їх обробки;
              </li>
              <li>
                отримувати інформацію про умови надання доступу до персональних
                даних, зокрема інформацію про третіх осіб, яким передаються Ваші
                персональні дані;
              </li>
              <li>
                отримувати не пізніше тридцяти календарних днів з дня
                надходження запиту (крім випадків, передбачених Законом України
                «Про захист персональних даних») інформацію щодо обробки та
                використання Ваших персональних даних;
              </li>
              <li>
                ставити вмотивовану вимогу володільцю персональних даних із
                запереченням щодо обробки Ваших персональних даних;
              </li>
              <li>
                звертатися зі скаргами щодо опрацювання Ваших персональних даних
                володільцем чи розпорядником персональних даних до
                Уповноваженого Верховної ради України з прав людини або до суду;
              </li>
              <li>
                застосовувати засоби правового захисту в разі порушення
                законодавства про захист персональних даних;
              </li>
              <li> відкликати згоду на обробку Ваших персональних даних.</li>
            </ul>
          </div>
        </div>
        <div className={styles.block}>
          <div
            className={`${styles.blockHeader} font-headline-l headline-l-m `}
          >
            9. Місцезнаходження персональних даних
          </div>
          <div className={`${styles.blockText} font-text-l-s `}>
            Володільцем та розпорядником персональних даних є головний відділ
            безпілотних авіаційних систем Державної Прикордонної Служби України
            “Фенікс”.
          </div>
        </div>
      </div>
    </section>
  );
};

export default SectionPolicy;
