import {
  DroneStalkerImage,
  DroneMatriceImage,
  DroneVampireImage,
  DroneInterceptorImage,
  DroneLelekaImage,
  GroundRobotImage,
} from "@/assets";

export const arsenalSection = {
  title: "ОЗБРОЄННЯ",
  subtitle:
    "Полк Фенікс має найефективніші засоби для ураження ворогу, розвідки та логістики: від FPV до БПЛА літакового типу та НРК.",
  items: [
    {
      title: "FPV ДРОНИ",
      image: DroneStalkerImage,
      imageAlt:
        "Спеціалізований FPV-дрон Stalker на оптоволокні для захисту від РЕБ, підрозділ Фенікс.",
      description:
        "FPV дрон - БПЛА, керування яким здійснюється від першої особи. Відеосигнал з дрону може передаватись через радіохвилі або через оптоволоконний кабель. FPV використовуються у ролі камікадзе з різними бойовими частинами або для скиду боєприпасів на противника.",
    },
    {
      title: "Квадрокоптери",
      image: DroneMatriceImage,
      imageAlt:
        "Розвідувальний квадрокоптер Matrice 4 підрозділу Фенікс у польоті над полем бою.",
      description:
        "Квадрокоптери - легкі бпла мультироторного типу з вертикальним зльотом і посадкою, а також з можливістю зависання в повітрі. Дані дрони мають підвищені характеристики маневреності та стабілізації польоту. Основними напрямками використання квадрокоптерів - аеророзвідка, корегування вогню, нанесення точкових ударів за рахунок скидів боєприпасів, а також доставки невеликих вантажів.",
    },
    {
      title: "Важкі бомбери",
      image: DroneVampireImage,
      imageAlt:
        "Нічний важкий дрон-бомбардувальник Vampire (Вампір) підрозділу Фенікс під час виконання завдання.",
      description:
        "Важкі бомбери - це великі ударні БПЛА мультикоптерного типу, які мають підвищену точність, вантажопідйомність до 15 кг та дальність польоту до 15 км. Важкі бомбери виконують різноманітні функції серед яких скиди боєприпасів, мінування, доставка вантажів, а інколи й евакуація поранених.",
    },
    {
      title: "Перехоплювачі",
      image: DroneInterceptorImage,
      imageAlt:
        "Ударний перехоплювач P1-sun у небі - техніка підрозділу Фенікс для боротьби з ворожими БПЛА.",
      description:
        "Важкі бомбери - це великі ударні БПЛА мультикоптерного типу, які мають підвищену точність, вантажопідйомність до 15 кг та дальність польоту до 15 км. Важкі бомбери виконують різноманітні функції серед яких скиди боєприпасів, мінування, доставка вантажів, а інколи й евакуація поранених.",
    },
    {
      title: "Ударні та розвідувальні крила",
      image: DroneLelekaImage,
      imageAlt:
        "Безпілотник літакового типу Leleka-100 (Лелека) проводить повітряну розвідку підрозділу Фенікс.",
      description:
        "Важкі бомбери - це великі ударні БПЛА мультикоптерного типу, які мають підвищену точність, вантажопідйомність до 15 кг та дальність польоту до 15 км. Важкі бомбери виконують різноманітні функції серед яких скиди боєприпасів, мінування, доставка вантажів, а інколи й евакуація поранених.",
    },
    {
      title: "Наземні Роботизовані Комплекси",
      image: GroundRobotImage,
      imageAlt:
        "Нічний важкий дрон-бомбардувальник Vampire (Вампір) підрозділу Фенікс під час виконання завдання.",
      description:
        "Наземний роботизований комплекс підрозділу Фенікс для логістики та евакуації на передовій.",
    }
  ],
  primaryCta: { text: "ДОЛУЧИТИСЬ ДО КОМАНДИ" },
  secondaryCta: { text: "ПЕРЕГЛЯНУТИ ВАКАНСІЇ", href: "/vacancies" },
};
