export const cookiesSectionUa = {
  title: "Використання Cookies",
  blocks: [
    {
      header: "1. Загальні положення",
      text: (
        <>
          Ця Політика використання файлів cookie пояснює, як веб-сайт https://usfenix.army/ (далі – "Сайт") використовує файли cookie та подібні технології для збору та обробки інформації про вас. Ми використовуємо файли cookie для забезпечення належної роботи Сайту та надання кращого користувацького досвіду.
        </>
      ),
    },
    {
      header: "2. Що таке файли cookie?",
      text: (
        <>
          Файли cookie – це невеликі текстові файли, які зберігаються на вашому пристрої, коли ви відвідуєте веб-сайт. Вони використовуються для збору інформації про ваші вибори та налаштування, а також для збору даних для аналізу та покращення функціонування Сайту.
        </>
      ),
    },
    {
      header: "3. Типи файлів cookie, які ми використовуємо",
      text: (
        <>
          Файли необхідні для роботи: ці файли допомагають забезпечити правильну роботу Сайту та доступ до основних функцій.
          <br /><br />
          Файли аналітики: ми використовуємо файли cookie для збору анонімних даних про використання Сайту, щоб розуміти, як користувачі взаємодіють з контентом та покращити його якість.
        </>
      ),
    },
    {
      header: "4. Керування файлами cookie",
      text: (
        <>
          Ви маєте можливість керувати використанням файлів cookie через налаштування вашого веб-браузера. Ви можете вибрати блокування всіх файлів cookie або отримати попередження перед їх збереженням. Зверніть увагу, що вимкнення файлів cookie може призвести до обмеження доступу до деяких функцій Сайту.
        </>
      ),
    },
    {
      header: "5. Відмова від відповідальності",
      text: (
        <>
          Ми не несемо відповідальність за файли cookie та технології третіх сторін, які можуть використовуватися на Сайті. Рекомендуємо переглядати політику конфіденційності та використання файлів cookie цих третіх сторін.
        </>
      ),
    },
    {
      header: "6. Зміни в Політиці використання файлів cookie",
      text: (
        <>
          Адміністратор Сайту час від часу оновлювати цю Політику. Будь ласка, періодично переглядайте цей документ, щоб бути в курсі будь-яких змін.
        </>
      ),
    },
  ],
};
