export const donationsSection = {
  title: "Закриті збори",
  description:
    "Кожен донат для нас неймовірно важливий. Всі зібрані кошти ми використовуємо за призначенням та конвертуємо їх в результат. Дякуємо за підтримку!",
  blocks: [
    {
      title: "збір на реб",
      text:
        "Збір на засоби радіоелектронної боротьби. Завдяки їм ми можемо забезпечити безпеку наших пілотів на позиціях.",
      sum: "зібрано: 500 000 грн",
      videoId: "IOtFDqeimOI",
    },
    {
      title: "збір на дрони перехоплювачі",
      text:
        "Збір на FPV-перехоплювачі - дрони, які збиватимуть ворожі розвідувальні БПЛА.",
      sum: "зібрано: 500 000 грн",
      videoId: "IOtFDqeimOI",
    },
    {
      title: "збір на дрони перехоплювачі",
      text:
        "Збір на FPV-перехоплювачі - дрони, які збиватимуть ворожі розвідувальні БПЛА.",
      sum: "зібрано: 500 000 грн",
      videoId: "IOtFDqeimOI",
    },
  ],
};
